from fontTools.ttLib import TTFont
import requests
from lxml import etree
import json
headers = {
    'User-Agent': 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/88.0.4324.104 Safari/537.36',
    'Cookie': 'navCtgScroll=0; fspop=test; cy=4; cye=guangzhou; _lxsdk_cuid=1774236ec57c8-0bbca1d1dcd1bf-13e3563-e1000-1774236ec58c8; _lxsdk=1774236ec57c8-0bbca1d1dcd1bf-13e3563-e1000-1774236ec58c8; _hc.v=907b46d9-9950-02d5-7a2d-52cc88879d06.1611723633; _lx_utm=utm_source%3Dgoogle%26utm_medium%3Dorganic; Hm_lvt_602b80cf8079ae6591966cc70a3940e7=1611723633,1611723648; s_ViewType=10; _lxsdk_s=1774236ec59-4eb-9af-411%7C%7C101; Hm_lpvt_602b80cf8079ae6591966cc70a3940e7=1611723670',
    'Host': 'www.dianping.com',
}

def parse_html(url):
    html = requests.get(url,headers=headers)
    if html.status_code == 200:
        get_html(html)
    else:
        print(html.status_code)

def get_html(html):
    content = html.text
    # num = jiemi()
    # for key in num:
    #     if key in content:
    #         content = content.replace('\\u'+key, str(num[key]))
    #         print('\\u'+key,str(num[key]))
    soup = etree.HTML(content)
    txt = soup.xpath('//div[@class="txt"]')

    for t in txt:
        #标题
        title = t.xpath('./div[@class="tit"]/a/@title')[0]
        #标签
    tag = soup.xpath('//div[@class="txt"]/div[@class="tag-addr"]/a/span[@class="tag"]/svgmtsi/text()')
    print(tag)
    with open('1.txt', 'a+', encoding='utf-8')as f:
        f.write(tag)
        jiemi(tag)


def jiemi(tag):
    font_name = '4165b8d8.woff'
    font = TTFont(font_name)
    font1 = font.getGlyphOrder()[2:]  # 解析字体
    font1 = [font1[i][-4:] for i in range(len(font1))]  # 取最后四位编码

    font2 = ['1', '2', '3', '4', '5', '6', '7', '8',
        '9', '0', '店', '中', '美', '家', '馆', '小', '车', '大',
        '市', '公', '酒', '行', '国', '品', '发', '电', '金', '心',
        '业', '商', '司', '超', '生', '装', '园', '场', '食', '有',
        '新', '限', '天', '面', '工', '服', '海', '华', '水', '房',
        '饰', '城', '乐', '汽', '香', '部', '利', '子', '老', '艺',
        '花', '专', '东', '肉', '菜', '学', '福', '饭', '人', '百',
        '餐', '茶', '务', '通', '味', '所', '山', '区', '门', '药',
        '银', '农', '龙', '停', '尚', '安', '广', '鑫', '一', '容',
        '动', '南', '具', '源', '兴', '鲜', '记', '时', '机', '烤',
        '文', '康', '信', '果', '阳', '理', '锅', '宝', '达', '地',
        '儿', '衣', '特', '产', '西', '批', '坊', '州', '牛', '佳',
        '化', '五', '米', '修', '爱', '北', '养', '卖', '建', '材',
        '三', '会', '鸡', '室', '红', '站', '德', '王', '光', '名',
        '丽', '油', '院', '堂', '烧', '江', '社', '合', '星', '货',
        '型', '村', '自', '科', '快', '便', '日', '民', '营', '和',
        '活', '童', '明', '器', '烟', '育', '宾', '精', '屋', '经',
        '居', '庄', '石', '顺', '林', '尔', '县', '手', '厅', '销',
        '用', '好', '客', '火', '雅', '盛', '体', '旅', '之', '鞋',
        '辣', '作', '粉', '包', '楼', '校', '鱼', '平', '彩', '上',
        '吧', '保', '永', '万', '物', '教', '吃', '设', '医', '正',
        '造', '丰', '健', '点', '汤', '网', '庆', '技', '斯', '洗',
        '料', '配', '汇', '木', '缘', '加', '麻', '联', '卫', '川',
        '泰', '色', '世', '方', '寓', '风', '幼', '羊', '烫', '来',
        '高', '厂', '兰', '阿', '贝', '皮', '全', '女', '拉', '成',
        '云', '维', '贸', '道', '术', '运', '都', '口', '博', '河',
        '瑞', '宏', '京', '际', '路', '祥', '青', '镇', '厨', '培',
        '力', '惠', '连', '马', '鸿', '钢', '训', '影', '甲', '助',
        '窗', '布', '富', '牌', '头', '四', '多', '妆', '吉', '苑',
        '沙', '恒', '隆', '春', '干', '饼', '氏', '里', '二', '管',
        '诚', '制', '售', '嘉', '长', '轩', '杂', '副', '清', '计',
        '黄', '讯', '太', '鸭', '号', '街', '交', '与', '叉', '附',
        '近', '层', '旁', '对', '巷', '栋', '环', '省', '桥', '湖',
        '段', '乡', '厦', '府', '铺', '内', '侧', '元', '购', '前',
        '幢', '滨', '处', '向', '座', '下', '県', '凤', '港', '开',
        '关', '景', '泉', '塘', '放', '昌', '线', '湾', '政', '步',
        '宁', '解', '白', '田', '町', '溪', '十', '八', '古', '双',
        '胜', '本', '单', '同', '九', '迎', '第', '台', '玉', '锦',
        '底', '后', '七', '斜', '期', '武', '岭', '松', '角', '纪',
        '朝', '峰', '六', '振', '珠', '局', '岗', '洲', '横', '边',
        '济', '井', '办', '汉', '代', '临', '弄', '团', '外', '塔',
        '杨', '铁', '浦', '字', '年', '岛', '陵', '原', '梅', '进',
        '荣', '友', '虹', '央', '桂', '沿', '事', '津', '凯', '莲',
        '丁', '秀', '柳', '集', '紫', '旗', '张', '谷', '的', '是',
        '不', '了', '很', '还', '个', '也', '这', '我', '就', '在',
        '以', '可', '到', '错', '没', '去', '过', '感', '次', '要',
        '比', '觉', '看', '得', '说', '常', '真', '们', '但', '最',
        '喜', '哈', '么', '别', '位', '能', '较', '境', '非', '为',
        '欢', '然', '他', '挺', '着', '价', '那', '意', '种', '想',
        '出', '员', '两', '推', '做', '排', '实', '分', '间', '甜',
        '度', '起', '满', '给', '热', '完', '格', '荐', '喝', '等',
        '其', '再', '几', '只', '现', '朋', '候', '样', '直', '而',
        '买', '于', '般', '豆', '量', '选', '奶', '打', '每', '评',
        '少', '算', '又', '因', '情', '找', '些', '份', '置', '适',
        '什', '蛋', '师', '气', '你', '姐', '棒', '试', '总', '定',
        '啊', '足', '级', '整', '带', '虾', '如', '态', '且', '尝',
        '主', '话', '强', '当', '更', '板', '知', '己', '无', '酸',
        '让', '入', '啦', '式', '笑', '赞', '片', '酱', '差', '像',
        '提', '队', '走', '嫩', '才', '刚', '午', '接', '重', '串',
        '回', '晚', '微', '周', '值', '费', '性', '桌', '拍', '跟',
        '块', '调', '糕']

    font_data = dict(map(lambda x,y:[x,y],font1,font2))
    # return font_data
    font_list = tag

    font_list = [str(i.encode("unicode_escape"))[-5:-1] if len(repr(i)) > 3 else i for i in font_list]  # 提取后四位


    # for f in font_list:
    #     print(f)



if __name__ == '__main__':
    url = 'http://www.dianping.com/guangzhou/ch10'
    parse_html(url)
